<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>Linux 系统编程导读 - 简介 - icepng&#39;s  blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x8BF4;&amp;#x662F;Linux&amp;#x7CFB;&amp;#x7EDF;&amp;#x7F16;&amp;#x7A0B;&amp;#x4E00;&amp;#x4E66;&amp;#x7684;&amp;#x5BFC;&amp;#x8BFB;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x53EA;&amp;#x662F;&amp;#x5BF9;Linux&amp;#x7CFB;&amp;#x7EDF;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x5B66;&amp;#x4E6">
<meta property="og:type" content="article">
<meta property="og:title" content="Linux 系统编程导读 - 简介">
<meta property="og:url" content="https://icepng.github.io/2017/09/18/Linux-System-Programming/index.html">
<meta property="og:site_name" content="icepng&#39;s  blog">
<meta property="og:description" content="&amp;#x8BF4;&amp;#x662F;Linux&amp;#x7CFB;&amp;#x7EDF;&amp;#x7F16;&amp;#x7A0B;&amp;#x4E00;&amp;#x4E66;&amp;#x7684;&amp;#x5BFC;&amp;#x8BFB;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x53EA;&amp;#x662F;&amp;#x5BF9;Linux&amp;#x7CFB;&amp;#x7EDF;&amp;#x7F16;&amp;#x7A0B;&amp;#x7684;&amp;#x5B66;&amp;#x4E6">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2017-09-18T02:15:57.000Z">
<meta property="article:modified_time" content="2017-09-27T03:49:53.662Z">
<meta property="article:author" content="icepng">
<meta property="article:tag" content="basic">
<meta property="article:tag" content="linux">
<meta name="twitter:card" content="summary">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/tomorrow-night-bright.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <p> ICEPNG </p>
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
            <a class="navbar-item "
               href="/categories">Categories</a>
            
            <a class="navbar-item "
               href="/categories/vuls">Vuls</a>
            
            <a class="navbar-item "
               href="/categories/5G">5G</a>
            
            <a class="navbar-item "
               href="/categories/iots">iots</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Search" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="Table of Contents">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#简介">1&nbsp;&nbsp;<b>简介</b></a>
                    
                    
                    
                    <a class="navbar-item" href="#文件">1.1&nbsp;&nbsp;文件</a>
                    
                    
                    
                    <a class="navbar-item" href="#目录和链接">1.1.1&nbsp;&nbsp;目录和链接</a>
                    
                    
                    
                    <a class="navbar-item" href="#硬链接">1.1.2&nbsp;&nbsp;硬链接</a>
                    
                    
                    
                    <a class="navbar-item" href="#软链接-符号链接">1.1.3&nbsp;&nbsp;软链接(符号链接)</a>
                    
                    
                    
                    <a class="navbar-item" href="#特殊文件">1.1.4&nbsp;&nbsp;特殊文件</a>
                    
                    
                    
                    <a class="navbar-item" href="#文件系统与命令空间">1.1.5&nbsp;&nbsp;文件系统与命令空间</a>
                    
                    
                    
                    <a class="navbar-item" href="#进程和线程">1.2&nbsp;&nbsp;进程和线程</a>
                    
                    
                    
                    <a class="navbar-item" href="#用户、组和权限">1.3&nbsp;&nbsp;用户、组和权限</a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/icepng" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            Linux 系统编程导读 - 简介
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2017-09-18T02:15:57.000Z" itemprop="datePublished">Sep 18 2017</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/linux/">linux</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            13 minutes read (About 1970 words)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x8BF4;&#x662F;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x4E00;&#x4E66;&#x7684;&#x5BFC;&#x8BFB;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x5BF9;Linux&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x7684;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x5427;&#x3002;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x5176;&#x5B9E;&#x8BF4;&#x5230;&#x5E95;&#x5C31;&#x662F;&#x501F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6240;&#x63D0;&#x4F9B;&#x7684;API&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x529F;&#x80FD;&#x6027;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C3D;&#x53EF;&#x80FD;&#x53BB;&#x4E86;&#x89E3;&#x5176;&#x5DE5;&#x4F5C;&#x7684;&#x539F;&#x7406;&#x3002;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x76EE;&#x5F55;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;<br>&#x6587;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;(I/O); &#x8FDB;&#x7A0B;; &#x5185;&#x5B58;; &#x4FE1;&#x53F7;; &#x65F6;&#x95F4;&#x3002;&#x4E5F;&#x5C31;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x8FD9;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#x6765;&#x5B66;&#x4E60;&#x5B66;&#x4E60;&#x3002;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x7B80;&#x77ED;&#x7684;&#x8BED;&#x8A00;&#x4EE5;&#x53CA;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x63CF;&#x8FF0;&#x3002;</p>
<h2 id="&#x7B80;&#x4ECB;"><a href="#&#x7B80;&#x4ECB;" class="headerlink" title="&#x7B80;&#x4ECB;"></a>&#x7B80;&#x4ECB;</h2><p>&#x6309;&#x7167; 1.4 Linux&#x7F16;&#x7A0B;&#x6982;&#x5FF5;&#x6765;&#x63CF;&#x8FF0;</p>
<h3 id="&#x6587;&#x4EF6;"><a href="#&#x6587;&#x4EF6;" class="headerlink" title="&#x6587;&#x4EF6;"></a>&#x6587;&#x4EF6;</h3><p>&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;fd&#xFF0C;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x5728;&#x4F7F;&#x7528;Linux C&#x7684;open&#x51FD;&#x6570;&#x6765;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x503C;&#xFF1B;<br></p><figure class="highlight c hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">open</span><span class="hljs-params">(<span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> *path, <span class="hljs-keyword">int</span> oflag, ... )</span></span>;</span><br></pre></td></tr></tbody></table></figure><br>&#x8BE5;&#x6574;&#x6570;&#x503C;&#x5C31;&#x662F;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4E86;&#x3002;&#x5728;&#x4F7F;&#x7528;open&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6765;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x4E86;&#x3002;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x662F;&#x5185;&#x6838;&#x4E3A;&#x4E86;&#x9AD8;&#x6548;&#x7BA1;&#x7406;&#x5DF2;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x7D22;&#x5F15;&#xFF1B;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#xFF0C;0&#x662F;&#x6807;&#x51C6;&#x8F93;&#x5165;&#xFF0C;1&#x662F;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF0C;2&#x662F;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x53BB;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x4F1A;&#x662F;3&#x3002;<br>&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8FDB;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x6765;&#x5BF9;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;<br>&#x53C2;&#x8003;&#xFF1A;<a href="http://blog.csdn.net/cywosp/article/details/38965239" target="_blank" rel="noopener">http://blog.csdn.net/cywosp/article/details/38965239</a><p></p>
<ol>
<li>&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x600E;&#x6837;&#x548C;&#x5B9E;&#x9645;&#x6587;&#x4EF6;&#x5BF9;&#x5E94;?<br>&#x65E2;&#x7136;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x5230;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5BF9;&#x5E94;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x8868;&#xFF0C;&#x7D22;&#x5F15;key&#x5C31;&#x662F;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x7136;&#x540E;value&#x5C31;&#x662F;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x591F;&#x5F88;&#x5BB9;&#x6613;&#x5F62;&#x6210;&#x5BF9;&#x5E94;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8BBF;&#x95EE;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x6587;&#x4EF6;&#x4E86;&#x3002;<br>Linux&#x7684;&#x505A;&#x6CD5;&#x4E5F;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x9996;&#x5148;&#x8FDB;&#x7A0B;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x5373;&#x8868;&#x793A;&#x8BE5;&#x8FDB;&#x7A0B;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#xFF1B;&#x5185;&#x6838;&#x5BF9;&#x6240;&#x6709;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5EFA;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x8868;&#x6765;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF08;&#x731C;&#x6D4B;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x5BF9;&#x4FE1;&#x606F;&#x76F8;&#x540C;&#x7684;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x53EA;&#x5B58;&#x50A8;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x51CF;&#x5C11;&#x6D88;&#x8017;&#xFF09;&#xFF0C;&#x8FDB;&#x7A0B;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x8868;&#x6307;&#x5411;&#x7EDF;&#x4E00;&#x7684;&#x8868;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x6253;&#x5F00;&#x8868;&#x4F1A;&#x8BB0;&#x5F55;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x6253;&#x5F00;&#x7684;&#x65B9;&#x5F0F;(W/R)&#x3001;&#x6587;&#x4EF6;&#x7684;&#x7C7B;&#x578B;&#x7B49;&#x7B49;&#xFF1B;&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x5305;&#x542B;&#x4E00;&#x4E2A;inode&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x4E00;&#x4E2A;inode&#x8868;&#x3002;<br>inode(information node)&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x5728;&#x78C1;&#x76D8;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x7B49;&#xFF0C;&#x7528;&#x5B83;&#x6765;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5B83;&#x6765;&#x8BBF;&#x95EE;&#x5230;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x6587;&#x4EF6;&#x3002;</li>
</ol>
<h4 id="&#x76EE;&#x5F55;&#x548C;&#x94FE;&#x63A5;"><a href="#&#x76EE;&#x5F55;&#x548C;&#x94FE;&#x63A5;" class="headerlink" title="&#x76EE;&#x5F55;&#x548C;&#x94FE;&#x63A5;"></a>&#x76EE;&#x5F55;&#x548C;&#x94FE;&#x63A5;</h4><p>&#x7528;&#x6237;&#x76F4;&#x63A5;&#x901A;&#x8FC7;inode&#x6765;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x7684;&#x4E0D;&#x65B9;&#x4FBF;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x5F15;&#x5165;&#x4E86; &#x201C;&#x76EE;&#x5F55;&#x201D; &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x76EE;&#x5F55;&#x7528;&#x4E8E;&#x5C06;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x5B57;&#x548C;inode&#x7F16;&#x53F7;&#x8FDB;&#x884C;&#x6620;&#x5C04;&#xFF1B;&#x540D;&#x5B57;&#x548C;inode&#x7684;&#x914D;&#x5BF9;&#x79F0;&#x4E3A;&#x94FE;&#x63A5;&#x3002;<br>&#x5F53;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x6253;&#x5F00;a.txt&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x6587;&#x4EF6;&#x540D;&#x6307;&#x5B9A;&#x7684;&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x641C;&#x7D22;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x627E;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x5BF9;&#x5E94;&#x627E;&#x5230;&#x5176;inode&#x7F16;&#x53F7;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x5176;inode&#x3002;<br>&#x8BE5;&#x4E66;&#x7ED9;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE; /home/blackbeard/landscaping.txt&#x65F6;&#xFF0C;&#x5BF9;&#x5E94;&#x6BCF;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF08;&#x5E38;&#x8BF4;&#x7684;&#x6587;&#x4EF6;&#x5939;&#xFF09;&#xFF0C;&#x4E5F;&#x5C06;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;inode&#xFF1B;&#x90A3;&#x4E48;&#x627E;&#x5230;landscaping.txt&#x7684;&#x987A;&#x5E8F;&#x4E3A;&#xFF1A;&#x9996;&#x5148;&#x662F;&#x5728;&#x6839;&#x76EE;&#x5F55; &#x201C;/&#x201C;&#x4E0B;&#x9762;&#x641C;&#x7D22;&#xFF0C;&#x627E;&#x5230;home&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;inode&#xFF0C;&#x8DF3;&#x8F6C;&#x5230;&#x8BE5;&#x4F4D;&#x7F6E;&#xFF1B;&#x7EE7;&#x7EED;&#x5728;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x641C;&#x7D22;blackbeard&#xFF0C;&#x627E;&#x5230;&#x5176;&#x5BF9;&#x5E94;&#x7684;inode&#xFF0C;&#x8DF3;&#x8F6C;&#xFF1B;&#x6700;&#x540E;&#x5728;&#x8BE5;&#x76EE;&#x5F55;&#x4E0B;&#x627E;&#x5230;landscaping.txt&#x5E76;&#x7D22;&#x5F15;&#x5F97;&#x5230;&#x5176;&#x5BF9;&#x5E94;&#x7684;inode&#xFF0C;&#x4ECE;&#x800C;&#x627E;&#x5230;&#x6587;&#x4EF6;&#x3002;<br>&#x8FD9;&#x91CC;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5047;&#x8BBE;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x9762;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#x5230;inode&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x94FE;&#x63A5;(link)&#xFF1B;&#x5220;&#x9664;&#x8BE5;&#x6587;&#x4EF6;&#x65F6;&#x5C06;&#x4F1A;&#x89E3;&#x9664;&#x94FE;&#x63A5;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x5220;&#x9664;&#x94FE;&#x63A5;(unlink)&#x3002;</p>
<h4 id="&#x786C;&#x94FE;&#x63A5;"><a href="#&#x786C;&#x94FE;&#x63A5;" class="headerlink" title="&#x786C;&#x94FE;&#x63A5;"></a>&#x786C;&#x94FE;&#x63A5;</h4><p>&#x5982;&#x679C;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#x94FE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;&#x786C;&#x94FE;&#x63A5;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x4FDD;&#x62A4;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5047;&#x8BBE;&#x6709;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x786C;&#x94FE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x7B97;&#x8BEF;&#x5220;&#x9664;&#x4E86;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x8BBF;&#x95EE;&#x5230;&#x6570;&#x636E;&#xFF1B;(ln 1.txt 2.txt #&#x4E3A;1.txt&#x521B;&#x5EFA;&#x94FE;&#x63A5;2.txt)<br>&#x786C;&#x94FE;&#x63A5;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x94FE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;inode&#xFF0C;&#x5373;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x6570;&#x636E;&#xFF1B;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5F53;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x4E4B;&#x540E;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4E5F;&#x662F;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x5230;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x80FD;&#x591F;&#x6267;&#x884C;&#x5220;&#x9664;inode&#xFF1B;&#x6240;&#x4EE5;inode&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x94FE;&#x63A5;&#x8BA1;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x94FE;&#x63A5;&#x5230;&#x8BE5;inode&#x7684;&#x6587;&#x4EF6;&#x540D;&#x6570;&#x91CF;&#xFF0C;&#x5F53;&#x4E3A;0&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x4E86;&#x3002;&#x7C7B;&#x4F3C;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</p>
<h4 id="&#x8F6F;&#x94FE;&#x63A5;-&#x7B26;&#x53F7;&#x94FE;&#x63A5;"><a href="#&#x8F6F;&#x94FE;&#x63A5;-&#x7B26;&#x53F7;&#x94FE;&#x63A5;" class="headerlink" title="&#x8F6F;&#x94FE;&#x63A5;(&#x7B26;&#x53F7;&#x94FE;&#x63A5;)"></a>&#x8F6F;&#x94FE;&#x63A5;(&#x7B26;&#x53F7;&#x94FE;&#x63A5;)</h4><p>&#x7C7B;&#x4F3C;&#x4E8E;&#x5E38;&#x8BF4;&#x7684;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x94FE;&#x63A5;&#x5230;&#x5B9E;&#x9645;&#x7684;inode&#x6570;&#x636E;&#xFF1B;&#x800C;&#x662F;&#x5305;&#x542B;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;&#x6240;&#x4EE5;&#x70B9;&#x51FB;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x627E;&#x5230;&#x539F;&#x59CB;&#x6587;&#x4EF6;&#x540D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x901A;&#x8FC7;&#x8BE5;&#x4F4D;&#x7F6E;&#x627E;&#x5230;inode&#x3002;(ln -s 1.txt symbolicLink)<br>&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x5C31;&#x7B97;&#x6CA1;&#x6709;1.txt&#xFF0C;&#x4E5F;&#x662F;&#x80FD;&#x591F;&#x521B;&#x5EFA;symbolicLink&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x8BBF;&#x95EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x4F4D;&#x7F6E;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x800C;&#x5DF2;&#x3002;<br>&#x786C;&#x94FE;&#x63A5;&#x3001;&#x8F6F;&#x94FE;&#x63A5;&#x8BE6;&#x7EC6;&#x53EF;&#x53C2;&#x8003;: <a href="http://blog.csdn.net/u013777351/article/details/50557260" target="_blank" rel="noopener">http://blog.csdn.net/u013777351/article/details/50557260</a></p>
<h4 id="&#x7279;&#x6B8A;&#x6587;&#x4EF6;"><a href="#&#x7279;&#x6B8A;&#x6587;&#x4EF6;" class="headerlink" title="&#x7279;&#x6B8A;&#x6587;&#x4EF6;"></a>&#x7279;&#x6B8A;&#x6587;&#x4EF6;</h4><p>&#x5757;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x3001;&#x5B57;&#x7B26;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#x3001;&#x547D;&#x4EE4;&#x7BA1;&#x9053;&#x3001;Unix&#x57DF;&#x5957;&#x63A5;&#x5B57;</p>
<h4 id="&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0E;&#x547D;&#x4EE4;&#x7A7A;&#x95F4;"><a href="#&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0E;&#x547D;&#x4EE4;&#x7A7A;&#x95F4;" class="headerlink" title="&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0E;&#x547D;&#x4EE4;&#x7A7A;&#x95F4;"></a>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0E;&#x547D;&#x4EE4;&#x7A7A;&#x95F4;</h4><p>&#x8BE6;&#x89C1;&#xFF1A;<a href="https://www.ibm.com/developerworks/cn/linux/l-linux-filesystem/index.html" target="_blank" rel="noopener">https://www.ibm.com/developerworks/cn/linux/l-linux-filesystem/index.html</a></p>
<h3 id="&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;"><a href="#&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;" class="headerlink" title="&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;"></a>&#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;</h3><p>&#x8FDB;&#x7A0B;&#x7684;&#x7BA1;&#x7406;&#xFF1A;Linux&#x4E2D;&#x8FDB;&#x7A0B;&#x6709;&#x4E00;&#x4E2A;&#x4E25;&#x683C;&#x7684;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x8FDB;&#x7A0B;&#x6811;&#xFF1B;&#x8FDB;&#x7A0B;&#x6811;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;init&#x8FDB;&#x7A0B;&#x4E3A;&#x6839;&#xFF0C;&#x65B0;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;fork&#x521B;&#x5EFA;&#xFF0C;&#x65B0;&#x8FDB;&#x7A0B;&#x4E3A;&#x8C03;&#x7528;fork&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x5B50;&#x8FDB;&#x7A0B;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7236;&#x8FDB;&#x7A0B;&#x5728;&#x5B50;&#x8FDB;&#x7A0B;&#x524D;&#x7EC8;&#x6B62;&#xFF0C;&#x90A3;&#x4E48;&#x5185;&#x6838;&#x5C06;&#x6307;&#x5B9A;init&#x8FDB;&#x7A0B;&#x4E3A;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#xFF1B;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x7236;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC8;&#x6B62;&#x540E;&#xFF0C;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x4ECE;&#x7CFB;&#x7EDF;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x5185;&#x6838;&#x5C06;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x8FDB;&#x7A0B;&#x7684;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5141;&#x8BB8;&#x7236;&#x8FDB;&#x7A0B;&#x67E5;&#x8BE2;&#x8BE5;&#x8FDB;&#x7A0B;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x7EC8;&#x6B62;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x786E;&#x5B9A;&#x7EC8;&#x6B62;&#x540E;&#x624D;&#x4F1A;&#x5B8C;&#x5168;&#x5220;&#x9664;&#x3002;<br>&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x7EC8;&#x6B62;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x5176;&#x7236;&#x8FDB;&#x7A0B;&#x5C1A;&#x672A;&#x83B7;&#x77E5;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x7528;&#x6237;&#x3001;&#x7EC4;&#x548C;&#x6743;&#x9650;"><a href="#&#x7528;&#x6237;&#x3001;&#x7EC4;&#x548C;&#x6743;&#x9650;" class="headerlink" title="&#x7528;&#x6237;&#x3001;&#x7EC4;&#x548C;&#x6743;&#x9650;"></a>&#x7528;&#x6237;&#x3001;&#x7EC4;&#x548C;&#x6743;&#x9650;</h3><p>&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x7528;&#x4E8E;&#x6743;&#x9650;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x4F7F;&#x7528;Linux&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x5728;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x4E2D;&#x80FD;&#x591F;&#x770B;&#x5230;&#x5176;&#x6240;&#x5C5E;&#x4E8E;&#x7684;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x7528;&#x6237;&#x7EC4;&#xFF0C;&#x4EE5;&#x4FBF;&#x7ED9;&#x4E88;&#x76F8;&#x5E94;&#x7684;&#x6743;&#x9650;&#x3002;<br></p><figure class="highlight bash hljs"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">varas@varas-virtual-machine:~$ ls -l ./a.txt </span><br><span class="line">-rw-rw-r-- 1 varas varas 0 9&#x6708;  20 11:37 ./a.txt</span><br></pre></td></tr></tbody></table></figure><br>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x6240;&#x5C5E;&#x4E8E;&#x7684;&#x7528;&#x6237;&#x548C;&#x7528;&#x6237;&#x7EC4;&#x90FD;&#x662F;varas&#xFF0C;&#x5BF9;&#x5E94;&#x4E8E;&#x5DE6;&#x8FB9;&#x7684;&#x4E09;&#x7EC4;&#x6743;&#x9650;&#xFF0C;&#x5206;&#x914D;&#x662F;&#x7528;&#x6237;&#x3001;&#x7528;&#x6237;&#x7EC4;&#x3001;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x6743;&#x9650;&#x3002;<br>&#x8FDB;&#x7A0B;&#x4E5F;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0E;&#x4E00;&#x4E2A;&#x7528;&#x6237;ID&#x5173;&#x8054;&#xFF0C;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x7528;&#x6237;<p></p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/basic/">#basic</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/linux/">#linux</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2017/09/21/Linux-System-Programming-1/">Linux 系统编程导读 - 文件I/O</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2017/09/15/idapython/">idapython</a>
            
        </span>
    </div>
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 icepng&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("en-AU");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Categories',
                TAGS: 'Tags',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>