<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>写在”BadPower“之后 - icepng&#39;s  blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="">





    <meta name="description" content="&amp;#x6BD5;&amp;#x4E1A;&amp;#x540E;&amp;#x53C2;&amp;#x52A0;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x505A;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x4EF6;&amp;#x4E8B;&amp;#x5C31;&amp;#x662F;&amp;#x8FD9;&amp;#x4E2A;&amp;#xFF0C;&amp;#x76EE;&amp;#x524D;&amp;#x7B97;&amp;#x662F;&amp;#x544A;&amp;#x4E00;">
<meta property="og:type" content="article">
<meta property="og:title" content="写在”BadPower“之后">
<meta property="og:url" content="https://icepng.github.io/2020/09/24/badpower/index.html">
<meta property="og:site_name" content="icepng&#39;s  blog">
<meta property="og:description" content="&amp;#x6BD5;&amp;#x4E1A;&amp;#x540E;&amp;#x53C2;&amp;#x52A0;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x505A;&amp;#x7684;&amp;#x7B2C;&amp;#x4E00;&amp;#x4EF6;&amp;#x4E8B;&amp;#x5C31;&amp;#x662F;&amp;#x8FD9;&amp;#x4E2A;&amp;#xFF0C;&amp;#x76EE;&amp;#x524D;&amp;#x7B97;&amp;#x662F;&amp;#x544A;&amp;#x4E00;">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/image-20200924103453343.png">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/clipboard.png">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/clipboard-1600897580720.png">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/image-20200924054916642-1600957928094.png">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/image-20200924223455628.png">
<meta property="og:image" content="https://icepng.github.io/images/badpower.assets/clipboard-1600899274140.png">
<meta property="article:published_time" content="2020-09-24T14:22:32.000Z">
<meta property="article:modified_time" content="2020-09-24T14:58:41.662Z">
<meta property="article:author" content="icepng">
<meta property="article:tag" content="iots">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://icepng.github.io/images/badpower.assets/image-20200924103453343.png">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/tomorrow-night-bright.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <p> ICEPNG </p>
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
            <a class="navbar-item "
               href="/categories">Categories</a>
            
            <a class="navbar-item "
               href="/categories/vuls">Vuls</a>
            
            <a class="navbar-item "
               href="/categories/5G">5G</a>
            
            <a class="navbar-item "
               href="/categories/iots">iots</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Search" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            <div class="navbar-item is-hoverable has-dropdown is-hidden-mobile is-hidden-tablet-only toc">
                <a class="navbar-item" title="Table of Contents">
                    <i class="fa fa-list"></i>
                </a>
                <div class="navbar-dropdown is-right">
                    
                    
                    
                    
                    <a class="navbar-item" href="#划水阶段">1&nbsp;&nbsp;<b>划水阶段</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#Fuzz一下？">2&nbsp;&nbsp;<b>Fuzz一下？</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#然后怎么弄">3&nbsp;&nbsp;<b>然后怎么弄?</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#硬件玩法">4&nbsp;&nbsp;<b>硬件玩法?</b></a>
                    
                    
                    <hr class="navbar-divider">
                    
                    
                    <a class="navbar-item" href="#后续">5&nbsp;&nbsp;<b>后续</b></a>
                    
                </div>
            </div>
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/icepng" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            写在”BadPower“之后
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2020-09-24T14:22:32.000Z" itemprop="datePublished">Sep 24 2020</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/iots/">iots</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            20 minutes read (About 2957 words)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><p>&#x6BD5;&#x4E1A;&#x540E;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#xFF0C;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x76EE;&#x524D;&#x7B97;&#x662F;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#x3002;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x633A;&#x6709;&#x7EAA;&#x5FF5;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5B66;&#x6821;&#x671F;&#x95F4;&#x56E0;&#x4E3A;&#x505A;&#x7684;&#x6A21;&#x7CCA;&#x6D4B;&#x8BD5;&#xFF0C;&#x7EAF;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5F00;&#x59CB;&#x641E;&#x786C;&#x4EF6;&#x8D70;&#x4E86;&#x5F88;&#x591A;&#x5F2F;&#x8DEF;&#xFF0C;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x641E;&#x4E86;&#x8FD1;&#x4E00;&#x5E74;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x4E8B;&#x540E;&#xFF0C;&#x5176;&#x5B9E;&#x60F3;&#x4E86;&#x60F3;&#x5F53;&#x65F6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x611F;&#x89C9;&#x8981;&#x662F;&#x518D;&#x505A;&#x7C7B;&#x4F3C;&#x4E8E;&#x7684;&#x4F30;&#x8BA1;&#x80FD;&#x7701;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x7ECF;&#x5386;&#x8FD8;&#x662F;&#x633A;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;&#x52A0;&#x4E0A;&#x6700;&#x8FD1;&#x770B;&#x8131;&#x53E3;&#x79C0;&#x6709;&#x70B9;&#x4E0A;&#x5934;,&#x8001;&#x662F;&#x60F3;&#x5199;&#x70B9;&#x4E1C;&#x897F;. &#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x8981;&#x662F;&#x6709;&#x5E78;&#x6709;&#x4EBA;&#x770B;&#x5230;&#xFF0C;&#x5E76;&#x4E14;&#x89C9;&#x5F97;&#x6709;&#x4E9B;&#x7528;&#x7684;&#x8BDD;&#x90A3;&#x662F;&#x6781;&#x597D;&#x7684;&#x3002;</p>
<p><strong>&#x8BDD;&#x8BF4;</strong>&#x5F53;&#x5E74;&#x521A;&#x6BD5;&#x4E1A;&#xFF0C;&#x52A0;&#x5165;&#x7384;&#x6B66;&#x3002;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#xFF1F;</p>
<p>xxx: &#x8FD9;&#x6709;&#x4E2A;&#x5FEB;&#x5145;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x53EF;&#x4EE5;&#x505A;</p>
<p>&#x6211;&#xFF1A;&#x5FEB;&#x5145;&#x5B89;&#x5168;&#xFF1F;&#xFF08;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5E73;&#x65F6;&#x80CC;&#x7740;ThinkPad&#x90A3;&#x5768;&#x5927;&#x7535;&#x6E90;&#xFF0C;&#x7528;&#x7740;5V/1A&#x7684;&#x624B;&#x673A;&#x5145;&#x7535;&#x5668;&#xFF0C;&#x8FD8;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x5FEB;&#x5145;&#x662F;&#x5565;&#x2026;..&#xFF09;</p>
<p>xxx: &#x5C31;&#x662F;xxxxx</p>
<p>&#x6211;&#xFF1A;&#x54E6;&#x54E6; &#x5C31;&#x662F;&#x641E;&#x5145;&#x7535;&#x5668;&#x554A;&#xFF08;&#x5176;&#x5B9E;&#x5F53;&#x65F6;&#x5185;&#x5FC3;&#x8D3C;&#x8FF7;&#x60D1;&#xFF0C;&#x5145;&#x7535;&#x5668;&#x4E5F;&#x80FD;&#x641E;&#xFF0C;&#x771F;&#x7684;&#x7279;&#x4F69;&#x670D;tk&#x7684;&#x8111;&#x6D1E;&#xFF0C;&#x7B2C;&#x4E00;&#x610F;&#x8BC6;&#x5C31;&#x662F;&#x96BE;&#x9053;&#x662F;&#x7528;&#x9524;&#x5B50;&#x3002;&#x3002;&#x3002;&#x672C;&#x7740;&#x521D;&#x51FA;&#x725B;&#x728A;&#x4E0D;&#x6015;&#x864E;&#xFF0C;&#x9876;&#x7740;&#x597D;&#x5947;&#x5FC3;<del>~</del>&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x2026;&#xFF09;&#x53EF;&#x4EE5;&#x53EF;&#x4EE5;&#xFF0C;&#x6709;&#x610F;&#x601D;</p>
<p>&#x7136;&#x540E;&#x6211;&#x5C31;&#x8BA4;&#x9886;&#x4E86; <a href="http://www.chongdiantou.com" target="_blank" rel="noopener">www.chongdiantou.com</a> &#x5174;&#x51B2;&#x51B2;&#x7684;&#x56DE;&#x5230;&#x5DE5;&#x4F4D;&#x3002;&#x201D;&#x4E0A;&#x5145;&#x7535;&#x5934;&#x7F51;&#xFF0C;&#x638C;&#x63E1;&#x4E00;&#x624B;&#x5145;&#x7535;&#x8BBE;&#x5907;&#x8BC4;&#x6D4B;&#x62C6;&#x89E3;&#x4FE1;&#x606F;&#xFF0C;&#x65E0;&#x8BBA;&#x60A8;&#x662F;&#x60F3;&#x4E70;&#x5145;&#x7535;&#x5668;&#x8FD8;&#x662F;&#x60F3;&#x505A;&#x5145;&#x7535;&#x5668;&#xFF0C;&#x5145;&#x7535;&#x5934;&#x7F51;&#x90FD;&#x662F;&#x60A8;&#x7684;&#x4E0D;&#x4E8C;&#x9009;&#x62E9;&#x3002;&#x5145;&#x7535;&#x5934;&#x7F51;&#xFF0C;&#x5B9E;&#x5728;&#x5C45;&#x5BB6;&#x65C5;&#x884C;&#xFF0C;&#x76F4;&#x64AD;&#x5E26;&#x8D27;&#xFF0C;&#x5FC5;&#x5907;&#x826F;&#x7AD9;&#x201C;&#xFF08;&#x6700;&#x8FD1;&#x771F;&#x7684;&#x662F;&#x88AB;&#x8131;&#x53E3;&#x79C0;&#x5927;&#x4F1A;&#x7684;&#x84DD;&#x6CB3;&#x7EF5;&#x7F8A;&#x5976;&#x7ED9;&#x6D17;&#x8111;&#x4E86;&#x2026;&#x2026; &#x4E00;&#x5EA6;&#x6709;&#x60F3;&#x8F6C;&#x884C;&#x5199;&#x6BB5;&#x5B50;&#x7684;&#x5FF5;&#x60F3;&#x2026;&#x2026;&#xFF09;&#x3002;&#x56DE;&#x5F52;&#x6B63;&#x4F20;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x6253;&#x5E7F;&#x544A;&#xFF0C;&#x7684;&#x786E;&#x662F;&#x5145;&#x7535;&#x5934;&#x7F51;&#x5728;&#x6574;&#x4E2A;&#x7814;&#x7A76;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E2E;&#x52A9;&#x5F88;&#x5927;&#x3002;</p>
<h2 id="&#x5212;&#x6C34;&#x9636;&#x6BB5;"><a href="#&#x5212;&#x6C34;&#x9636;&#x6BB5;" class="headerlink" title="&#x5212;&#x6C34;&#x9636;&#x6BB5;"></a>&#x5212;&#x6C34;&#x9636;&#x6BB5;</h2><p>&#x5176;&#x5B9E;&#x6BD4;&#x8F83;&#x4E13;&#x4E1A;&#x7684;&#x672F;&#x8BED;&#x5E94;&#x8BE5;&#x53EB;&#x505A;&#x201D;&#x7814;&#x7A76;&#x76EE;&#x6807;&#x4E0E;&#x653B;&#x51FB;&#x9762;&#x5206;&#x6790;&#x201C;&#x3002;&#x4E70;&#x4E86;&#x4E2A;&#x67D0;&#x679C;&#x7684;&#x5145;&#x7535;&#x5668;&#x5F00;&#x59CB;&#x201D;&#x7814;&#x7A76;&#x201C;&#xFF0C;&#x5F53;&#x7136;&#x9664;&#x4E86;&#x611F;&#x89C9;&#x771F;&#x8D35;&#xFF0C;&#x624B;&#x611F;&#x4E0D;&#x9519;&#xFF0C;&#x8D28;&#x91CF;&#x5F88;&#x597D;&#xFF0C;&#x5F88;&#x91CD;&#x5F88;&#x7ED3;&#x5B9E;&#x5916;&#xFF0C;&#x8FD8;&#x662F;&#x53D1;&#x73B0;&#x4E86;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x5145;&#x7535;&#x53E3;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#x5728;&#x4E0D;&#x9524;&#x6389;&#x5B83;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x653B;&#x51FB;&#x5165;&#x53E3;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;typec&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x4E86;&#x5F88;&#x5E38;&#x89C4;&#x7684;&#x8C03;&#x7814;&#x6D41;&#x7A0B;&#x4E86;&#x3002;</p>
<p>&#x55EF;&#xFF0C;&#x5145;&#x7535;&#x5668;&#x91CC;&#x9762;&#x6709;&#x4E2A;&#x82AF;&#x7247;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x56FA;&#x4EF6;&#x3002;</p>
<p>&#x55EF;&#xFF0C;&#x5FEB;&#x5145;&#x662F;&#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x5FEB;&#x5145;&#x534F;&#x8BAE;&#x6709;QC,VOOC&#x2026;&#x2026; &#x7136;&#x540E;&#x5C31;&#x662F;&#x4E3B;&#x6D41;&#x7684;USB PD</p>
<p>&#x55EF;&#xFF0C;&#x53EA;&#x6709;USB PD&#x662F;&#x5305;&#x542B;&#x6570;&#x636E;&#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x6709;&#x6570;&#x636E;&#x5305;&#x7684;&#xFF0C;&#x534F;&#x8BAE;&#x6807;&#x51C6;&#x662F;&#x5F00;&#x6E90;&#x7684;&#xFF0C;&#x901A;&#x8FC7;typec&#x63A5;&#x53E3;&#x4F20;&#x8F93;</p>
<p>&#x65B9;&#x5411;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;usb pd&#x534F;&#x8BAE;&#x662F;&#x5165;&#x53E3;&#x3002;&#x5F00;&#x59CB;&#x5543;USB PD&#x534F;&#x8BAE;&#x6587;&#x6863;&#xFF0C;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x5148;&#x5F04;&#x6E05;&#x695A;&#x90FD;&#x662F;&#x548B;&#x56DE;&#x4E8B;&#x3002;&#x5F53;&#x770B;&#x4E86;&#x534F;&#x8BAE;&#x6587;&#x6863;&#x4E4B;&#x540E;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x5F88;&#x597D;&#x5947;&#x4EBA;&#x5BB6;&#x5145;&#x7535;&#x5668;&#x5230;&#x5E95;&#x6709;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x4E0D;&#x597D;&#x8BF4;&#xFF0C;&#x5C31;&#x4E00;&#x80A1;&#x8111;&#x60F3;&#x770B;&#x770B;&#x80FD;&#x4E0D;&#x80FD;&#x6293;&#x5230;&#x5305;&#x770B;&#x770B;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x4E2A;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x5728;&#x5145;&#x7535;&#x5934;&#x7F51;&#x4E0A;&#x6252;&#x62C9;&#xFF0C;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x5F00;&#x4E86;&#x4E2A;&#x6DD8;&#x5B9D;&#x5E97;&#xFF0C;&#x5728;&#x5356;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x8BBE;&#x5907;Power-Z&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x6B3E;Power-Z KM001 Pro&#x8FD8;&#x5E26;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF0C;&#x80FD;&#x591F;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x5F53;&#x65F6;&#x8FD8;&#x6709;&#x4E2A;&#x5C0F;&#x63D2;&#x66F2;&#xFF0C;&#x4E70;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x7ED9;&#x53D1;&#x9519;&#x8D27;&#x4E86;&#xFF0C;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x8D35;&#x7684;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x548B;&#x7528;&#xFF0C;&#x5176;&#x5B9E;&#x5F53;&#x65F6;&#x4E5F;&#x6CA1;&#x60F3;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E00;&#x4E2A;&#x4FBF;&#x5B9C;&#x7684;&#x90FD;&#x652F;&#x6301;&#xFF0C;&#x8D35;&#x7684;&#x5C31;&#x4E0D;&#x7528;&#x8BF4;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x7FA4;&#x91CC;&#x95EE;&#xFF0C;&#x7ED3;&#x679C;&#x4E0D;&#x652F;&#x6301;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x3002;&#x3002;&#x3002;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x6709;&#x4E13;&#x95E8;&#x7684;USB PD&#x534F;&#x8BAE;&#x5305;&#x663E;&#x793A;&#xFF0C;&#x4F46;&#x6709;&#x9650;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x53D1;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7279;&#x5B9A;&#x7684;&#x5305;&#x51FA;&#x53BB;&#x3002;&#x521D;&#x671F;&#x57FA;&#x672C;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x597D;&#x6B79;&#x662F;&#x770B;&#x5230;&#x4E86;&#x5B9E;&#x9645;&#x7684;&#x5305;&#x957F;&#x5565;&#x6837;&#x4E86;&#xFF0C;&#x4E00;&#x4E9B;&#x4E5F;&#x548C;&#x534F;&#x8BAE;&#x5BF9;&#x4E0A;&#x6765;&#x4E86;&#x3002;</p>
<img src="/images/badpower.assets/image-20200924103453343.png" alt="image-20200924103453343" style="zoom: 33%;">

<h2 id="Fuzz&#x4E00;&#x4E0B;&#xFF1F;"><a href="#Fuzz&#x4E00;&#x4E0B;&#xFF1F;" class="headerlink" title="Fuzz&#x4E00;&#x4E0B;&#xFF1F;"></a>Fuzz&#x4E00;&#x4E0B;&#xFF1F;</h2><p>&#x5F00;&#x542F;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x6A21;&#x5F0F;&#xFF0C;&#x4ED6;&#x8FD9;&#x4E2A;power-z&#x662F;&#x6709;&#x4E2A;sniffer&#x6A21;&#x5F0F;&#x548C;&#x4E00;&#x4E2A;monitor&#x6A21;&#x5F0F;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x6211;&#x662F;&#x60F3;&#x770B;&#x770B;&#x67D0;&#x679C;&#x7684;&#x5145;&#x7535;&#x5668;&#x548C;&#x7B14;&#x8BB0;&#x672C;&#x4E4B;&#x95F4;&#x90FD;&#x6709;&#x5565;&#x6D88;&#x606F;&#xFF0C;&#x6240;&#x4EE5;&#x91C7;&#x7528;monitor&#x6A21;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x76F8;&#x5F53;&#x5C34;&#x5C2C;&#xFF0C;&#x56E0;&#x4E3A;USB PD&#x6570;&#x636E;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x6211;&#x731C;&#x8FD9;&#x4E2A;&#x8BBE;&#x5907;&#x8BBE;&#x8BA1;&#x4E0A;&#x662F;&#x5148;&#x628A;&#x6570;&#x636E;&#x5B58;&#x5728;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x7684;RAM&#x91CC;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x901A;&#x8FC7;USB&#x7AEF;&#x53E3;&#x53D1;&#x7ED9;&#x7535;&#x8111;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x592A;&#x5FEB;&#xFF0C;&#x53D1;&#x73B0;&#x8FDE;&#x7EED;&#x7684;&#x51E0;&#x6B21;&#x901A;&#x4FE1;&#x4E4B;&#x540E;&#x76F4;&#x63A5;&#x5D29;&#x4E86;&#x3002;&#x76F8;&#x5F53;&#x5C34;&#x5C2C;&#x3002;</p>
<p>&#x7136;&#x540E;&#x60F3;&#x7740;&#x8FD8;&#x662F;&#x76F2;&#x6D4B;&#x4E00;&#x4E0B;&#x5427;&#x3002;&#x6BD5;&#x7ADF;USB PD&#x534F;&#x8BAE;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x590D;&#x6742;&#x3002;&#x5C31;&#x56DE;&#x5230;&#x4E86;&#x4E0A;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x8F6F;&#x4EF6;&#x6240;&#x652F;&#x6301;&#x53D1;&#x9001;&#x7684;&#x5305;&#x5C31;&#x7279;&#x5B9A;&#x7684;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#xFF0C;&#x5176;&#x5B9E;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x53BB;&#x627E;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x95EE;&#x95EE;&#x80FD;&#x4E0D;&#x80FD;&#x7ED9;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8FD9;&#x4E48;&#x7C7B;&#x4F3C;&#x81EA;&#x5B9A;&#x4E49;&#x4EFB;&#x610F;&#x5305;&#x7684;&#x529F;&#x80FD;&#x3002;&#x7136;&#x540E;&#x5F00;&#x53D1;&#x8005;&#x8BF4;&#x201C;&#x4F60;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5F88;&#x597D;&#xFF0C;&#x6211;&#x8003;&#x8651;&#x540E;&#x7EED;&#x6DFB;&#x52A0;&#x201D;&#x3002; &#x8FD9;&#x4E00;&#x542C;&#x5C31;&#x77E5;&#x9053;&#x662F;&#x6CA1;&#x620F;&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x4E5F;&#x6CA1;&#x62C9;&#x4E0B;&#x8138;&#x8981;&#x4E00;&#x4E0B;&#x6E90;&#x7801;&#xFF0C;&#x867D;&#x7136;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#x3002;&#x3002;&#x3002;</p>
<p>&#x53EA;&#x80FD;&#x81EA;&#x7ED9;&#x81EA;&#x8DB3;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;ida+windbg&#x201C;&#x5B66;&#x4E60;&#x201D;&#x4E86;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x8F6F;&#x4EF6;&#x4E0A;&#x4F4D;&#x673A;&#x548C;&#x4E0B;&#x4F4D;&#x673A;power-z&#x7684;&#x901A;&#x4FE1;&#x4E5F;&#x5C31;&#x5F88;&#x6E05;&#x6670;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x4EFB;&#x610F;&#x5305;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x6D4B;&#x8BD5;&#x63A7;&#x5236;&#x4E00;&#x4E0B;&#x901F;&#x5EA6;&#xFF0C;power-z&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x3002;&#x53D1;&#x5305;-&#x56DE;&#x590D;&#x3002; &#x53EA;&#x5269;&#x4E0B;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x6709;&#x6CA1;&#x6709;&#x5D29;&#xFF1F;</p>
<p>&#x6211;&#x53D1;&#x73B0;USB PD&#x53D7;&#x7535;&#x7AEF;&#x662F;&#x53EF;&#x4EE5;&#x53D1;&#x9001;get source cap&#x6765;&#x83B7;&#x53D6;&#x5145;&#x7535;&#x5668;&#x7684;&#x4F9B;&#x7535;&#x80FD;&#x529B;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x5D29;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x53D1;&#x9001;&#x5C31;&#x80AF;&#x5B9A;&#x662F;&#x6CA1;&#x6709;&#x56DE;&#x5E94;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x5305;&#x540E;&#xFF0C;&#x518D;&#x53D1;&#x4E00;&#x4E2A;get source cap&#x6765;&#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x5D29;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6240;&#x6709;&#x7684;&#x5305;&#x90FD;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x534F;&#x8BAE;&#x89C4;&#x5B9A;&#x6709;&#x90E8;&#x5206;&#x662F;&#x53EF;&#x4EE5;&#x5382;&#x5546;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x6240;&#x4EE5;fuzz&#x7A7A;&#x95F4;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5168;0&#xFF0C;&#x5168;F&#x7C7B;&#x4F3C;&#x8FD9;&#x79CD;&#xFF0C;&#x7136;&#x540E;&#x90E8;&#x5206;&#x968F;&#x673A;&#xFF0C;&#x53CD;&#x6B63;&#x662F;&#x5F88;&#x5E38;&#x89C4;&#x7684;&#x5957;&#x8DEF;&#x3002;&#x8BA9;&#x4ED6;&#x5728;&#x90A3;&#x8DD1;&#x7740;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5C31;&#x9ED8;&#x9ED8;&#x5543;&#x6587;&#x6863;&#x3002;&#x4E0B;&#x9762;&#x4E5F;&#x4E0D;&#x8BB0;&#x5F97;&#x662F;&#x54EA;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x622A;&#x56FE;&#x4E86;&#xFF0C;&#x5927;&#x6982;&#x6837;&#x5B50;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<img src="/images/badpower.assets/clipboard.png" alt="clipboard" style="zoom: 33%;">

<p>&#x7ED3;&#x679C;&#x561B;&#x2026;.. &#x65E0;&#x8BBA;&#x6211;&#x5982;&#x4F55;fuzz, &#x5B83;&#x81EA;&#x5CBF;&#x7136;&#x4E0D;&#x52A8;. &#x7136;&#x540E;&#x5206;&#x6790;&#x4E86;&#x4E0B;&#x56DE;&#x5E94;&#x5305;, &#x53D1;&#x73B0;&#x201D;&#x8FD9;&#x5145;&#x7535;&#x5668;&#x6709;&#x4E1C;&#x897F;&#x201D;. &#x5C31;&#x5206;&#x6790;&#x6363;&#x9F13;,&#x731C;&#x6D4B;,&#x6D4B;&#x8BD5;,&#x628A;&#x90E8;&#x5206;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5305;&#x7684;&#x7ED3;&#x6784;&#x7406;&#x6E05;&#x695A;&#x4E86;,&#x731C;&#x6D4B;&#x54EA;&#x51E0;&#x4F4D;&#x5E72;&#x5565;&#x7528;&#x7684;, &#x7136;&#x540E;&#x662F;&#x600E;&#x4E48;&#x5904;&#x7406;,&#x600E;&#x4E48;&#x56DE;. &#x6700;&#x540E;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#x2026;&#x2026; &#x641E;&#x4E0D;&#x4E86;&#x554A;&#x2026;&#x2026; &#x8FC7;&#x6EE4;&#x5F97;&#x592A;&#x72E0;&#x4E86;, &#x8FDE;&#x4E2A;&#x4FE1;&#x606F;&#x6CC4;&#x9732;&#x90FD;&#x6CA1;&#x6CD5;&#x5F04;. (&#x540E;&#x8BDD;, &#x540E;&#x9762;&#x628A;&#x56FA;&#x4EF6;&#x5F04;&#x51FA;&#x6765;&#x4E86;,&#x90A3;&#x90E8;&#x5206;&#x7684;&#x786E;&#x548C;&#x6211;&#x731C;&#x6D4B;&#x7684;&#x4E00;&#x81F4;).</p>
<h2 id="&#x7136;&#x540E;&#x600E;&#x4E48;&#x5F04;"><a href="#&#x7136;&#x540E;&#x600E;&#x4E48;&#x5F04;" class="headerlink" title="&#x7136;&#x540E;&#x600E;&#x4E48;&#x5F04;?"></a>&#x7136;&#x540E;&#x600E;&#x4E48;&#x5F04;?</h2><p>&#x5176;&#x5B9E;&#x524D;&#x9762;fuzz&#x90FD;&#x662F;&#x5543;&#x8001;&#x672C;,&#x56E0;&#x4E3A;&#x4EE5;&#x524D;&#x505A;&#x8FC7;fuzz,&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x4E00;&#x70B9;. &#x4F46;&#x5176;&#x5B9E;&#x7F3A;&#x9677;&#x4E5F;&#x5F88;&#x660E;&#x663E;, &#x9996;&#x5148;&#x662F;fuzz&#x7A7A;&#x95F4;&#x592A;&#x5927;,&#x57FA;&#x672C;&#x662F;&#x6CA1;&#x6CD5;&#x6240;&#x6709;&#x8BD5;&#x4E00;&#x8BD5;&#x7684;,&#x5C31;&#x7B97;&#x8DD1;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;,&#x603B;&#x4E4B;&#x679A;&#x4E3E;&#x4E0D;&#x9760;&#x8C31;(&#x4E3B;&#x8981;&#x8FD8;&#x6709;&#x4E2A;&#x95EE;&#x9898;,power-z&#x8DD1;&#x4E45;&#x4E86;&#x6709;&#x65F6;&#x5019;&#x5C31;&#x6CA1;&#x6CD5;&#x7528;&#x4E86;&#x2026;&#x2026;) . &#x5176;&#x6B21;&#x5C31;&#x662F;&#x6211;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x5305;fuzz,&#x5145;&#x7535;&#x5668;&#x534F;&#x8BAE;&#x5185;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x4E2A;&#x72B6;&#x6001;&#x673A;&#x7684;,&#x8981;&#x662F;&#x5305;&#x4E4B;&#x95F4;&#x5173;&#x8054;,&#x57FA;&#x672C;&#x4E0A;&#x5C31;gg&#x4E86;.</p>
<p>&#x7136;&#x540E;&#x56DE;&#x5230;&#x4EE5;&#x524D;&#x7684;&#x95EE;&#x9898;,power-z&#x7684;monitor&#x662F;&#x53EF;&#x4EE5;&#x76D1;&#x542C;&#x7684;,&#x53EA;&#x662F;&#x8DD1;&#x7740;&#x5D29;&#x4E86;,&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x67D0;&#x679C;&#x81EA;&#x5DF1;&#x5230;&#x5E95;&#x5E72;&#x4E86;&#x4E9B;&#x5565;. &#x4F46;&#x76EE;&#x524D;&#x4E5F;&#x6CA1;&#x5565;&#x5176;&#x4ED6;&#x597D;&#x7528;&#x7684;&#x8BBE;&#x5907;&#x4E86;&#x2026;&#x2026; &#x6240;&#x4EE5;&#x76EE;&#x524D;&#x6700;&#x7701;&#x4E8B;&#x7684;&#x5C31;&#x662F;&#x5148;&#x770B;&#x770B;&#x5B83;&#x81EA;&#x5DF1;&#x548C;&#x81EA;&#x5DF1;&#x8BBE;&#x5907;&#x4EA4;&#x4E92;&#x5230;&#x5E95;&#x5E72;&#x4E86;&#x4E9B;&#x5565;&#x4E8B;&#x60C5;.</p>
<p>&#x5728;&#x5076;&#x7136;&#x7684;&#x673A;&#x4F1A;&#x77E5;&#x9053;&#x4E86;&#x903B;&#x8F91;&#x5206;&#x6790;&#x4EEA;,&#x5176;&#x5B9E;&#x641E;&#x786C;&#x4EF6;&#x7684;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;. &#x5F53;&#x65F6;&#x6211;&#x4E00;&#x542C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;,&#x611F;&#x89C9;&#x5F88;&#x9AD8;&#x7EA7;&#x7684;&#x611F;&#x89C9;,&#x4E3B;&#x8981;&#x662F;&#x88AB;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x7ED9;&#x552C;&#x4F4F;&#x4E86;. &#x903B;&#x8F91;, &#x5206;&#x6790;&#x4EEA;. &#x4E00;&#x542C;&#x5F88;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x6837;&#x5B50;.&#x60F3;&#x7740;&#x4F1A;&#x76F8;&#x5F53;&#x590D;&#x6742;. &#x5F53;&#x65F6;&#x6B63;&#x597D;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x67D0;&#x4E2A;&#x89D2;&#x843D;&#x6709;&#x4E2A;&#x53E4;&#x8001;&#x7684;&#x903B;&#x8F91;&#x5206;&#x6790;&#x4EEA;(&#x771F;&#x7684;&#x662F;&#x88AB;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x7ED9;&#x5751;&#x60E8;&#x4E86;&#x2026;&#x2026; &#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x6CA1;&#x5F04;&#x6E05;&#x695A;&#x2026;&#x2026;) , &#x4E3A;&#x4E86;&#x5B9E;&#x9A8C;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x73A9;&#x610F;,&#x4E70;&#x4E86;&#x4E2A;&#x5168;&#x5957;&#x7684;&#x91D1;&#x6C99;&#x6EE9;51&#x5355;&#x7247;&#x673A;&#x5F00;&#x53D1;&#x677F;,&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4EE3;&#x7801;,&#x89C6;&#x9891;&#x4E4B;&#x7C7B;&#x7684;&#x90FD;&#x6709;. &#x7136;&#x540E;&#x70E7;&#x4E86;&#x4E2A;&#x4E32;&#x53E3;&#x901A;&#x4FE1;&#x7684;&#x7A0B;&#x5E8F;&#x8FDB;&#x53BB;,&#x7528;&#x903B;&#x8F91;&#x5206;&#x6790;&#x4EEA;&#x4E00;&#x6293;, &#x55EF;, &#x771F;&#x9999;&#x2026;&#x2026;</p>
<p>&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x6293;&#x67D0;&#x679C;&#x5145;&#x7535;&#x5668;&#x548C;&#x67D0;&#x679C;&#x7B14;&#x8BB0;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x8BAF;&#x4E86;, &#x60F3;&#x7740;&#x5148;&#x6293;&#x6293;&#x770B;&#x770B;,&#x81F3;&#x5C11;&#x5F97;&#x770B;&#x5230;&#x70B9;&#x4E1C;&#x897F;, &#x7136;&#x540E;&#x5C31;&#x8C03;&#x9608;&#x503C;&#x7535;&#x538B;, &#x53CD;&#x6B63;&#x5B83;&#x90A3;&#x4E2A;&#x5C31;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#x9009;&#x9879;,&#x4E0D;&#x7BA1;&#x4E86;,&#x4E00;&#x4E2A;&#x4E2A;&#x8BD5;&#x4E00;&#x4E0B;, &#x7136;&#x540E;&#x5C31;&#x662F; &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;-, &#x4E00;&#x6761;&#x7279;&#x522B;&#x5E73;&#x6ED1;&#x7684;&#x76F4;&#x7EBF;&#x2026;&#x2026;. &#x7136;&#x540E;&#x5C31;&#x6709;&#x70B9;&#x61F5;&#x4E86;&#x2026;&#x2026; &#x8FD9;&#x53EA;&#x80FD;&#x8BF4;&#x660E;&#x9608;&#x503C;&#x7535;&#x538B;&#x6709;&#x95EE;&#x9898;&#x4E86;, &#x5F00;&#x59CB;&#x7EE7;&#x7EED;&#x5543;USB PD&#x6587;&#x6863;,&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x8DF3;&#x8FC7;&#x7269;&#x7406;&#x4F20;&#x8F93;&#x90A3;&#x5757;&#x770B;&#x7684;&#x2026;..</p>
<p>&#x55EF;, BMC, 4B5B&#x7F16;&#x7801;, &#x7136;&#x540E;&#x6BD4;&#x8F83;&#x66F2;&#x6298;&#x7684;&#x4E70;&#x4E86;&#x4E2A;LA5016, &#x8C03;&#x8282;&#x9608;&#x503C;&#x7535;&#x538B;&#x5230;0.45V, &#x53EF;&#x4EE5;&#x4E86;&#x2026; &#x4E00;&#x5F00;&#x59CB;&#x56FE;&#x7B80;&#x5355;,&#x628A;&#x6570;&#x636E;&#x5BFC;&#x51FA;&#x5230;txt,&#x7136;&#x540E;&#x5199;&#x4E86;&#x4E2A;python&#x811A;&#x672C;&#x6765;&#x89E3;&#x6790;&#x534F;&#x8BAE;,&#x770B;&#x8D77;&#x6765;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;.</p>
<img src="/images/badpower.assets/clipboard-1600897580720.png" alt="clipboard-1600897580720" style="zoom: 33%;">

<p>&#x8FD9;&#x4E2A;&#x7684;&#x540E;&#x7EED;&#x8BDD;,&#x4E3A;&#x4E86;&#x65B9;&#x4FBF; &#x5355;&#x72EC;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x89E3;&#x6790;&#x63D2;&#x4EF6;. &#x5BF9;&#x540E;&#x9762;&#x4E00;&#x4E9B;&#x5206;&#x6790;&#x5E2E;&#x52A9;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;. &#x957F;&#x8FD9;&#x4E48;&#x4E2A;&#x6837;&#x5B50;&#x2026;&#x2026;</p>
<img src="/images/badpower.assets/image-20200924054916642-1600957928094.png" alt="image-20200924054916642" style="zoom:50%;">

<p>&#x7136;&#x540E;&#x56DE;&#x5F52;&#x6B63;&#x9898;,&#x6293;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x4EA4;&#x4E92;, &#x53D1;&#x73B0;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x5565;&#x7528;&#x2026;.. &#x5C31;&#x662F;&#x83B7;&#x53D6;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;,&#x7248;&#x672C;&#x4FE1;&#x606F;&#x5565;&#x7684;. &#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E5F;fuzz&#x4E86;&#x4E00;&#x4E0B;,&#x4E5F;&#x6CA1;&#x5565;&#x597D;&#x7684;&#x6548;&#x679C;. </p>
<p>&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;power-z&#x7684;&#x786E;&#x4E0D;&#x592A;&#x597D;&#x7528;, &#x540E;&#x9762;&#x627E;&#x7A7A;&#x57FA;&#x4E8E;stm32g0&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x6B3E;, &#x5C01;&#x88C5;&#x4E86;&#x4E00;&#x5C42;python&#x63A5;&#x53E3;,&#x7528;&#x8D77;&#x6765;&#x201D;&#x771F;&#x9999;&#x201D;.</p>
<p>&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x2026;..</p>
<img src="/images/badpower.assets/image-20200924223455628.png" alt="image-20200924223455628" style="zoom: 25%;">

<p>&#x7528;&#x8D77;&#x6765;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x2026;..</p>
<img src="/images/badpower.assets/clipboard-1600899274140.png" alt="clipboard-1600899274140" style="zoom: 33%;">

<h2 id="&#x786C;&#x4EF6;&#x73A9;&#x6CD5;"><a href="#&#x786C;&#x4EF6;&#x73A9;&#x6CD5;" class="headerlink" title="&#x786C;&#x4EF6;&#x73A9;&#x6CD5;?"></a>&#x786C;&#x4EF6;&#x73A9;&#x6CD5;?</h2><p>&#x4E2D;&#x9014;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x803D;&#x8BEF;&#x4E86;,&#x540C;&#x65F6;&#x4E5F;&#x5B66;&#x4E60;&#x4E86;&#x786C;&#x4EF6;&#x76F8;&#x5173;&#x77E5;&#x8BC6;. &#x7136;&#x540E;&#x56DE;&#x8FC7;&#x5934;&#x6765;,&#x53EF;&#x4EE5;&#x62C6;&#x4E86;&#x6765;&#x5F04;&#x4E86;. &#x5176;&#x5B9E;&#x65E9;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x62C6;&#x4E86;&#x4E00;&#x4E2A;,&#x5F53;&#x65F6;&#x6211;&#x53BB;&#x8BD5;&#x8BD5;&#x770B;&#x770B;&#x8FD8;&#x80FD;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x7528;&#x7684;&#x65F6;&#x5019;,&#x56E0;&#x4E3A;&#x7535;&#x8FD8;&#x6CA1;&#x653E;&#x5B8C;,&#x7528;&#x624B;&#x6478;&#x4E86;&#x4E00;&#x4E0B;,&#x7535;&#x5F97;&#x6211;&#x4E00;&#x6FC0;&#x7075;.&#x6709;&#x70B9;&#x614C;&#x4E86;&#x2026;&#x2026; &#x518D;&#x52A0;&#x4E0A;&#x5F53;&#x65F6;&#x5BF9;&#x786C;&#x4EF6;&#x8FD8;&#x5B8C;&#x5168;&#x4E0D;&#x4E86;&#x89E3;,&#x6240;&#x4EE5;&#x6401;&#x7F6E;&#x4E86;.</p>
<p>&#x5F00;&#x59CB;&#x76F4;&#x63A5;&#x62C6;&#x4E86;&#x5F04;,&#x4E3B;&#x8981;&#x662F;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x5145;&#x7535;&#x5934;&#x7F51;&#x4E0A;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x62C6;&#x89E3;,&#x7136;&#x540E;&#x5BF9;&#x76F8;&#x5173;&#x82AF;&#x7247;&#x4E5F;&#x4E86;&#x89E3;&#x4E86;&#x5F88;&#x591A;,&#x52A0;&#x4E0A;&#x5728;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x8005;&#x8BBA;&#x575B;&#x4E00;&#x76F4;&#x6DF7;&#x7740;,&#x611F;&#x89C9;&#x4E5F;&#x6BD4;&#x8F83;&#x6709;&#x5E95;&#x4E86;.</p>
<p>&#x7136;&#x540E;&#x662F;&#x4E00;&#x5957;&#x786C;&#x4EF6;&#x76F8;&#x5173;&#x641E;&#x6CD5;,&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x5E38;&#x89C4;&#x7684;&#x65B9;&#x6CD5;,&#x53EA;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x5751;. &#x6700;&#x540E;&#x4E5F;&#x5F04;&#x51FA;&#x6765;&#x4E86;&#x56FA;&#x4EF6;. &#x9006;&#x5411;&#x5206;&#x6790;,&#x66F4;&#x65B0;&#x534F;&#x8BAE;,&#x6F0F;&#x6D1E;,&#x56FA;&#x4EF6;&#x4FEE;&#x6539;&#x7B49;&#x7B49;&#x8FD9;&#x4E00;&#x5957;&#x4E86;.</p>
<h2 id="&#x540E;&#x7EED;"><a href="#&#x540E;&#x7EED;" class="headerlink" title="&#x540E;&#x7EED;"></a>&#x540E;&#x7EED;</h2><p>&#x80FD;&#x63A7;&#x5236;&#x4E86;,&#x80FD;&#x5E72;&#x4EC0;&#x4E48;? &#x8FD9;&#x662F;&#x4E2A;&#x8111;&#x6D1E;&#x5927;&#x5F00;&#x7684;&#x8FC7;&#x7A0B;&#x2026;&#x2026; &#x5404;&#x79CD;&#x5C1D;&#x8BD5;&#x5427;,&#x867D;&#x7136;&#x6700;&#x540E;&#x662F;&#x4EE5;&#x201D;BadPower&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x5448;&#x73B0;. &#x4F46;&#x4E2D;&#x95F4;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x63D2;&#x66F2;.</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x6211;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;, &#x5F53;&#x65F6;&#x8FD8;&#x6CA1;&#x60F3;&#x592A;&#x591A;, &#x53EA;&#x662F;&#x60F3;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#x6211;&#x4FEE;&#x6539;&#x7684;&#x6709;&#x6CA1;&#x6709;&#x6548;&#x679C;, &#x800C;&#x5F53;&#x65F6;&#x5468;&#x56F4;&#x4E5F;&#x6CA1;&#x5565;&#x4E1C;&#x897F;,&#x7136;&#x540E;&#x5C31;&#x5F88;&#x60B2;&#x5267;&#x4E86;,&#x628A;&#x521A;&#x7ED9;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x667A;&#x80FD;&#x97F3;&#x7BB1;&#x7ED9;&#x70E7;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x662F;&#x2026;&#x2026; </p>
<p>&#x628A;MacBook&#x7684;&#x4E3B;&#x677F;&#x70E7;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x628A;pixel&#x624B;&#x673A;&#x5145;&#x7535;&#x7535;&#x8DEF;&#x7ED9;&#x5F04;&#x574F;&#x4E86;,&#x5145;&#x4E0D;&#x4E86;&#x7535;&#x4E86;&#x2026;&#x2026;</p>
<p>&#x2026;&#x2026;</p>
<p>&#x201C;&#x90A3;&#x4E9B;&#x8BBE;&#x5907;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x662F;&#x2026; &#x5371;&#x9669;&#x6B63;&#x5728;&#x4E00;&#x6B65; &#x4E00;&#x6B65;&#x5730;&#x5411;&#x5B83;&#x9760;&#x8FD1;&#x2026;&#x2026;&#x201D;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/iots/">#iots</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2020/09/24/ta-tai/">5G安全-概念之TA/TAI</a>
            
        </span>
    </div>
    
</article>




    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 icepng&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("en-AU");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Categories',
                TAGS: 'Tags',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>